using System;

namespace MusicBands.View
{
    public class InputData //За да не повтаряме излишно входни надписи
    {                              //Инстанцираме (за по-кратко) и си извикваме метода
                                   //ако направим метода static ще трябва да използваме
                                   //името на класа, което ще е значително по-дълго
                                   //от името на инстанцията
        public string Input(string notice, int maxLength)
        {
            Console.Write($"{notice} (под {maxLength} символа):");
            string data = Console.ReadLine();

            if (data.Length > maxLength)
            {
                Console.WriteLine("Моля, спазвайте ограниченията за дължина!");
                return Input(notice, maxLength);
                //изключително важно е да се извика с return, а не директно
                //ако се извика директно метода, то ако имате действия под проверката
                //ще се изпълнят толкова пъти колкото се е завъртяла рекурсията
                //return поема резултата от рекурсията в себе си и го предава към 
                //извикващия метод, т.е. си го самопредава и излиза от този ред
                //докато липсата му би напуснал тези скоби за всяко едно извикване
            }

            //действия под проверката

            return data;
        }
    }
}
